public class App {
    public static void main(String[] args) throws Exception {

        // 1. Напишите программу, которая выведет на экран 
        // "Hello Programming!" (без кавычек) на 2 строках, по слову на каждой (см. пример вывода)

        // 2. Напишите программу, которая выводит на экран строку "Hello, Java!" (без кавычек)
        System.out.println("Hello, Java!");


    }
}
